app/controllers/api/v1/courses_controller.rb

INSERT INTO "courses" ("name", "subject", "duration_month", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "\"BBBS\""], ["subject", nil], ["duration_month", nil], ["created_at", "2022-12-18 08:22:15.386784"], ["updated_at", "2022-12-18 08:22:15.386784"]]
---
	def create
		@course = Course.new(course_params)
		if @course.save

UPDATE "courses" SET "name" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["name", "\"  \""], ["updated_at", "2022-12-19 17:53:03.016206"], ["id", 16]]
---
	def update
		if @course.update(course_params)

SELECT "courses".* FROM "courses"
SELECT "tutors".* FROM "tutors" WHERE "tutors"."course_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def list_tutors
		courses = Course.includes(:tutors)
		response_array = []
		courses.each do |course|

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
	def find_course
		@course = Course.find_by_id(params[:id])