app/controllers/api/v1/tutors_controller.rb

	def index
		@tutors = Tutor.all
---
SELECT "tutors".* FROM "tutors"

	def create
		@tutor = Tutor.new(tutor_params)
		if @tutor.save
---
INSERT INTO "tutors" ("full_name", "course_id", "address", "mobile_no", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["full_name", "Chirag"], ["course_id", 1], ["address", nil], ["mobile_no", nil], ["email", nil], ["created_at", "2022-12-18 09:02:07.448938"], ["updated_at", "2022-12-18 09:02:07.448938"]]

	def update
		if 	@tutor.update(tutor_params)
---
UPDATE "tutors" SET "full_name" = ?, "course_id" = ?, "updated_at" = ? WHERE "tutors"."id" = ?  [["full_name", "\"hhh\""], ["course_id", 4], ["updated_at", "2022-12-20 11:38:36.926666"], ["id", 1]]

	def destroy
		if  @tutor.destroy
---
DELETE FROM "tutors" WHERE "tutors"."id" = ?  [["id", 11]]

	def find_tutor
		@tutor = Tutor.find(params[:id])
---
SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]